MARS-engineers/arduino-robotrix/hardware/rp2040/boards.txt
RoverOneV0.menu.opt.Small=Small (-Os) (standard)
RoverOneV0.menu.opt.Small.build.flags.optimize=-Os
RoverOneV0.menu.opt.Optimize=Optimize (-O)
RoverOneV0.menu.opt.Optimize.build.flags.optimize=-O
RoverOneV0.menu.opt.Optimize2=Optimize More (-O2)
RoverOneV0.menu.opt.Optimize2.build.flags.optimize=-O2
RoverOneV0.menu.opt.Optimize3=Optimize Even More (-O3)
RoverOneV0.menu.opt.Optimize3.build.flags.optimize=-O3
RoverOneV0.menu.opt.Fast=Fast (-Ofast) (maybe slower)
RoverOneV0.menu.opt.Fast.build.flags.optimize=-Ofast
RoverOneV0.menu.opt.Debug=Debug (-Og)
RoverOneV0.menu.opt.Debug.build.flags.optimize=-Og
RoverOneV0.menu.opt.Disabled=Disabled (-O0)
RoverOneV0.menu.opt.Disabled.build.flags.optimize=-O0

RoverOneV0.menu.os.none=None
RoverOneV0.menu.os.none.build.os=
RoverOneV0.menu.os.freertos=FreeRTOS SMP
RoverOneV0.menu.os.freertos.build.os=-D__FREERTOS

RoverOneV0.menu.dbgport.Disabled=Disabled
RoverOneV0.menu.dbgport.Disabled.build.debug_port=
RoverOneV0.menu.dbgport.Serial=Serial
RoverOneV0.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
RoverOneV0.menu.dbgport.Serial1=Serial1
RoverOneV0.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
RoverOneV0.menu.dbgport.Serial2=Serial2
RoverOneV0.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
RoverOneV0.menu.dbgport.SerialSemi=SerialSemi
RoverOneV0.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
RoverOneV0.menu.dbglvl.None=None
RoverOneV0.menu.dbglvl.None.build.debug_level=
RoverOneV0.menu.dbglvl.Core=Core
RoverOneV0.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
RoverOneV0.menu.dbglvl.SPI=SPI
RoverOneV0.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
RoverOneV0.menu.dbglvl.Wire=Wire
RoverOneV0.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
RoverOneV0.menu.dbglvl.Bluetooth=Bluetooth
RoverOneV0.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
RoverOneV0.menu.dbglvl.LWIP=LWIP
RoverOneV0.menu.dbglvl.LWIP.build.debug_level=-DLWIP_DEBUG=1
RoverOneV0.menu.dbglvl.All=All
RoverOneV0.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH -DLWIP_DEBUG=1
RoverOneV0.menu.dbglvl.NDEBUG=NDEBUG
RoverOneV0.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG

RoverOneV0.menu.uploadmethod.default=Default (UF2)
RoverOneV0.menu.uploadmethod.default.build.ram_length=256k
RoverOneV0.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
RoverOneV0.menu.uploadmethod.default.upload.maximum_data_size=262144
RoverOneV0.menu.uploadmethod.default.upload.tool=uf2conv
RoverOneV0.menu.uploadmethod.default.upload.tool.default=uf2conv
RoverOneV0.menu.uploadmethod.default.upload.tool.network=uf2conv-network
RoverOneV0.menu.uploadmethod.picotool=Picotool
RoverOneV0.menu.uploadmethod.picotool.build.ram_length=256k
RoverOneV0.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
RoverOneV0.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
RoverOneV0.menu.uploadmethod.picotool.upload.maximum_data_size=262144
RoverOneV0.menu.uploadmethod.picotool.upload.tool=picotool
RoverOneV0.menu.uploadmethod.picotool.upload.tool.default=picotool
RoverOneV0.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
RoverOneV0.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
RoverOneV0.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
RoverOneV0.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
RoverOneV0.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
RoverOneV0.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

# -----------------------------------
# Robotix Rover One V1
# -----------------------------------

RoverOneV1.name=Robotrix Rover One v1
RoverOneV1.build.board=ROBOTRIX_ROVER_ONE_V1

RoverOneV1.vid.0=0x2e8a
RoverOneV1.pid.0=0xf00f
RoverOneV1.vid.1=0x2e8a
RoverOneV1.pid.1=0xf10f
RoverOneV1.upload_port.0.vid=0x2e8a
RoverOneV1.upload_port.0.pid=0xf00f
RoverOneV1.upload_port.1.vid=0x2e8a
RoverOneV1.upload_port.1.pid=0xf10f
RoverOneV1.build.usbvid=-DUSBD_VID=0x2e8a
RoverOneV1.build.usbpid=-DUSBD_PID=0xf00f
RoverOneV1.build.usbpwr=-DUSBD_MAX_POWER_MA=250
RoverOneV1.build.variant=RoverOneV1
RoverOneV1.upload.maximum_size=16777216
RoverOneV1.upload.wait_for_upload_port=true
RoverOneV1.upload.erase_cmd=
RoverOneV1.serial.disableDTR=false
RoverOneV1.serial.disableRTS=false
RoverOneV1.build.f_cpu=125000000
RoverOneV1.build.led=
RoverOneV1.build.core=rp2040:rp2040
RoverOneV1.build.ldscript=memmap_default.ld
RoverOneV1.build.boot2=none
RoverOneV1.build.usb_manufacturer="MARS-Engineers"
RoverOneV1.build.usb_product="Robotix Rover One V2"

RoverOneV1.build.flags.exceptions=-fno-exceptions
RoverOneV1.build.flags.libstdcpp=-lstdc++
RoverOneV1.build.flags.stackprotect=-fstack-protector-all
RoverOneV1.build.variantdefines=-D__PICO_RP2350A=0
RoverOneV1.usbstack.picosdk.build.usbstack_flags=
RoverOneV1.ipbtstack.ipv4only.build.libpicow=liblwip.a
RoverOneV1.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
RoverOneV1.rtti.Disabled.build.flags.rtti=-fno-rtti


RoverOneV1.menu.flash.16777216_0=16MB (no FS)
RoverOneV1.menu.flash.16777216_0.upload.maximum_size=16769024
RoverOneV1.menu.flash.16777216_0.build.flash_total=16777216
RoverOneV1.menu.flash.16777216_0.build.flash_length=16769024
RoverOneV1.menu.flash.16777216_0.build.eeprom_start=285204480
RoverOneV1.menu.flash.16777216_0.build.fs_start=285204480
RoverOneV1.menu.flash.16777216_0.build.fs_end=285204480
RoverOneV1.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
RoverOneV1.menu.flash.16777216_8388608.upload.maximum_size=8380416
RoverOneV1.menu.flash.16777216_8388608.build.flash_total=16777216
RoverOneV1.menu.flash.16777216_8388608.build.flash_length=8380416
RoverOneV1.menu.flash.16777216_8388608.build.eeprom_start=285204480
RoverOneV1.menu.flash.16777216_8388608.build.fs_start=276815872
RoverOneV1.menu.flash.16777216_8388608.build.fs_end=285204480
RoverOneV1.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
RoverOneV1.menu.flash.16777216_4194304.upload.maximum_size=12574720
RoverOneV1.menu.flash.16777216_4194304.build.flash_total=16777216
RoverOneV1.menu.flash.16777216_4194304.build.flash_length=12574720
RoverOneV1.menu.flash.16777216_4194304.build.eeprom_start=285204480
RoverOneV1.menu.flash.16777216_4194304.build.fs_start=281010176
RoverOneV1.menu.flash.16777216_4194304.build.fs_end=285204480
RoverOneV1.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
RoverOneV1.menu.flash.16777216_2097152.upload.maximum_size=14671872
RoverOneV1.menu.flash.16777216_2097152.build.flash_total=16777216
RoverOneV1.menu.flash.16777216_2097152.build.flash_length=14671872
RoverOneV1.menu.flash.16777216_2097152.build.eeprom_start=285204480
RoverOneV1.menu.flash.16777216_2097152.build.fs_start=283107328
RoverOneV1.menu.flash.16777216_2097152.build.fs_end=285204480

