MARS-engineers/arduino-robotrix/hardware/rp2040/boards.txt
RoverOneV1.menu.arch.arm=ARM
RoverOneV1.menu.arch.arm.build.chip=rp2350
RoverOneV1.menu.arch.arm.build.toolchain=arm-none-eabi
RoverOneV1.menu.arch.arm.build.toolchainpkg=pqt-gcc
RoverOneV1.menu.arch.arm.build.toolchainopts=-mcpu=cortex-m33 -mthumb -march=armv8-m.main+fp+dsp -mfloat-abi=softfp -mcmse
RoverOneV1.menu.arch.arm.build.uf2family=--family rp2350-arm-s --abs-block
RoverOneV1.menu.arch.arm.build.mcu=cortex-m33
RoverOneV1.menu.arch.riscv=RISC-V
RoverOneV1.menu.arch.riscv.build.chip=rp2350-riscv
RoverOneV1.menu.arch.riscv.build.toolchain=riscv32-unknown-elf
RoverOneV1.menu.arch.riscv.build.toolchainpkg=pqt-gcc-riscv
RoverOneV1.menu.arch.riscv.build.toolchainopts=-march=rv32imac_zicsr_zifencei_zba_zbb_zbs_zbkb -mabi=ilp32
RoverOneV1.menu.arch.riscv.build.uf2family=--family rp2350-riscv --abs-block
RoverOneV1.menu.arch.riscv.build.mcu=rv32imac

RoverOneV1.menu.freq.150=150 MHz
RoverOneV1.menu.freq.150.build.f_cpu=150000000L
RoverOneV1.menu.freq.50=50 MHz
RoverOneV1.menu.freq.50.build.f_cpu=50000000L
RoverOneV1.menu.freq.100=100 MHz
RoverOneV1.menu.freq.100.build.f_cpu=100000000L
RoverOneV1.menu.freq.120=120 MHz
RoverOneV1.menu.freq.120.build.f_cpu=120000000L
RoverOneV1.menu.freq.125=125 MHz
RoverOneV1.menu.freq.125.build.f_cpu=125000000L
RoverOneV1.menu.freq.128=128 MHz
RoverOneV1.menu.freq.128.build.f_cpu=128000000L
RoverOneV1.menu.freq.133=133 MHz
RoverOneV1.menu.freq.133.build.f_cpu=133000000L
RoverOneV1.menu.freq.176=176 MHz (Overclock)
RoverOneV1.menu.freq.176.build.f_cpu=176000000L
RoverOneV1.menu.freq.200=200 MHz (Overclock)
RoverOneV1.menu.freq.200.build.f_cpu=200000000L
RoverOneV1.menu.freq.225=225 MHz (Overclock)
RoverOneV1.menu.freq.225.build.f_cpu=225000000L
RoverOneV1.menu.freq.240=240 MHz (Overclock)
RoverOneV1.menu.freq.240.build.f_cpu=240000000L
RoverOneV1.menu.freq.250=250 MHz (Overclock)
RoverOneV1.menu.freq.250.build.f_cpu=250000000L
RoverOneV1.menu.freq.276=276 MHz (Overclock)
RoverOneV1.menu.freq.276.build.f_cpu=276000000L
RoverOneV1.menu.freq.300=300 MHz (Overclock)
RoverOneV1.menu.freq.300.build.f_cpu=300000000L

RoverOneV1.menu.psramcs.GPIOnone=None
RoverOneV1.menu.psramcs.GPIOnone.build.psram_cs=
RoverOneV1.menu.psramcs.GPIO0=GPIO 0
RoverOneV1.menu.psramcs.GPIO0.build.psram_cs=-DRP2350_PSRAM_CS=0
RoverOneV1.menu.psram.0mb=0MByte PSRAM
RoverOneV1.menu.psram.0mb.build.psram_length=0x000000
RoverOneV1.menu.psram.2mb=2MByte PSRAM
RoverOneV1.menu.psram.2mb.build.psram_length=0x200000
RoverOneV1.menu.psram.4mb=4MByte PSRAM
RoverOneV1.menu.psram.4mb.build.psram_length=0x400000
RoverOneV1.menu.psram.8mb=8MByte PSRAM
RoverOneV1.menu.psram.8mb.build.psram_length=0x800000
RoverOneV1.menu.psramfreq.freq109=109 MHz
RoverOneV1.menu.psramfreq.freq109.build.psram_freq=-DRP2350_PSRAM_MAX_SCK_HZ=109000000
RoverOneV1.menu.psramfreq.freq133=133 MHz
RoverOneV1.menu.psramfreq.freq133.build.psram_freq=-DRP2350_PSRAM_MAX_SCK_HZ=133000000

RoverOneV1.menu.opt.Small=Small (-Os) (standard)
RoverOneV1.menu.opt.Small.build.flags.optimize=-Os
RoverOneV1.menu.opt.Optimize=Optimize (-O)
RoverOneV1.menu.opt.Optimize.build.flags.optimize=-O
RoverOneV1.menu.opt.Optimize2=Optimize More (-O2)
RoverOneV1.menu.opt.Optimize2.build.flags.optimize=-O2
RoverOneV1.menu.opt.Optimize3=Optimize Even More (-O3)
RoverOneV1.menu.opt.Optimize3.build.flags.optimize=-O3
RoverOneV1.menu.opt.Fast=Fast (-Ofast) (maybe slower)
RoverOneV1.menu.opt.Fast.build.flags.optimize=-Ofast
RoverOneV1.menu.opt.Debug=Debug (-Og)
RoverOneV1.menu.opt.Debug.build.flags.optimize=-Og
RoverOneV1.menu.opt.Disabled=Disabled (-O0)
RoverOneV1.menu.opt.Disabled.build.flags.optimize=-O0
RoverOneV1.menu.os.none=None
RoverOneV1.menu.os.none.build.os=
RoverOneV1.menu.os.freertos=FreeRTOS SMP
RoverOneV1.menu.os.freertos.build.os=-D__FREERTOS

RoverOneV1.menu.profile.Disabled=Disabled
RoverOneV1.menu.profile.Disabled.build.flags.profile=
RoverOneV1.menu.profile.Enabled=Enabled
RoverOneV1.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE

RoverOneV1.menu.dbgport.Disabled=Disabled
RoverOneV1.menu.dbgport.Disabled.build.debug_port=
RoverOneV1.menu.dbgport.Serial=SerialUSB
RoverOneV1.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
RoverOneV1.menu.dbgport.Serial1=Serial1
RoverOneV1.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1

RoverOneV1.menu.dbglvl.None=None
RoverOneV1.menu.dbglvl.None.build.debug_level=
RoverOneV1.menu.dbglvl.Core=Core
RoverOneV1.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
RoverOneV1.menu.dbglvl.SPI=SPI
RoverOneV1.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
RoverOneV1.menu.dbglvl.Wire=Wire
RoverOneV1.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
RoverOneV1.menu.dbglvl.Bluetooth=Bluetooth
RoverOneV1.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
RoverOneV1.menu.dbglvl.LWIP=LWIP
RoverOneV1.menu.dbglvl.LWIP.build.debug_level=-DLWIP_DEBUG=1
RoverOneV1.menu.dbglvl.All=All
RoverOneV1.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH -DLWIP_DEBUG=1
RoverOneV1.menu.dbglvl.NDEBUG=NDEBUG
RoverOneV1.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG

RoverOneV1.menu.uploadmethod.default=Default (UF2)
RoverOneV1.menu.uploadmethod.default.build.ram_length=512k
RoverOneV1.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
RoverOneV1.menu.uploadmethod.default.upload.maximum_data_size=524288
RoverOneV1.menu.uploadmethod.default.upload.tool=uf2conv
RoverOneV1.menu.uploadmethod.default.upload.tool.default=uf2conv
RoverOneV1.menu.uploadmethod.default.upload.tool.network=uf2conv-network
RoverOneV1.menu.uploadmethod.picotool=Picotool
RoverOneV1.menu.uploadmethod.picotool.build.ram_length=512k
RoverOneV1.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
RoverOneV1.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
RoverOneV1.menu.uploadmethod.picotool.upload.maximum_data_size=524288
RoverOneV1.menu.uploadmethod.picotool.upload.tool=picotool
RoverOneV1.menu.uploadmethod.picotool.upload.tool.default=picotool
RoverOneV1.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
RoverOneV1.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=512k
RoverOneV1.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
RoverOneV1.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=524288
RoverOneV1.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
RoverOneV1.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap


